Repository: danesjenovdan/melita
Catalog: melita/locale/*/LC_MESSAGES/django.po
Languages: et, nl, sl

source: Lessons
nl: Lessen
sl: Učne ure

source: Back to the list
et: Tagasi nimekirja juurde
nl: Terug naar de lijst
sl: Nazaj na seznam

source: Lesson goals
et: Tunni eesmärgid
nl: Lesdoelen
sl: Splošni cilji

source: Activities
et: Tegevused
nl: Activiteiten
sl: Aktivnosti

source: Keywords
et: Võtmesõnad
nl: Sleutelwoorden
sl: Ključne besede

source: Pedagogical tips and recommendations
et: Nõuanded ja soovitused õpetajale
nl: Pedagogische tips
sl: Nasveti in priporočila

source: Download lesson
et: Laadi tund/tunnikava alla
nl: Download les
sl: Prenesi učno uro

source: Download slides
et: Laadi slaidid alla
nl: Download presentatie
sl: Prenesi predstavitev

source: Download worksheet
et: Laadi tööleht alla
nl: Download werkblad
sl: Prenesi delovni list

source: Theme
et: Teema
nl: Thema
sl: Tema

source: Lesson duration
et: Tunni kestus
nl: Lesduur
sl: Čas učne ure

source: Main method of instruction
et: Peamine õpimeetod
nl: Belangrijkste lesmethode
sl: Učna oblika

source: Materials
et: Materjalid
nl: Materialen
sl: Pripomočki

source: Prep time for teacher
et: Ettevalmistusaeg (õpetajale)
nl: Voorbereidingstijd docent
sl: Čas priprave za učitelja_ico

source: Further reading
et: Lisalugemist
nl: Verder lezen
sl: Nadaljnja literatura

source: Sources
et: Allikad
nl: Bronnen
sl: Viri

source: Related lessons
et: Seotud tunnid
nl: Gerelateerde lessen
sl: Povezane učne ure

source: View live
sl: V živo

source: Back to the home page
et: Tagasi kodulehele
nl: Terug naar homepagina
sl: Nazaj na domačo stran

source: About
et: Platvormist
nl: Over het platform
sl: O platformi

source: How to use
et: Kuidas kasutada
nl: Hoe het werkt
sl: Kako uporabiti

source: Language selection
et: Keel
nl: Taalselectie
sl: Izbor jezikov
